W9/D2/first_routes_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-01-22 18:32:32.888522"], ["updated_at", "2020-01-22 18:32:32.888522"], ["username", "janedoe"]]
---
  def create
    user = User.new(user_params)

    if user.save